ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_СписокСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationFonecmidDiplomTuzeka/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

ConfigurationFonecmidDiplomTuzeka/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <recalculations>
    <name>ВКМ_ПерерасчетУдержаний</name>
  </recalculations>
</mdclass:CalculationRegister>

ConfigurationFonecmidDiplomTuzeka/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	СтавкаНДФЛ = 0.13;

	Для Каждого СтрокаСписка Из ВКМ_СписокСотрудников Цикл

		ДвижениеПремия = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеПремия.ПериодРегистрации = НачалоДня(Дата);
		ДвижениеПремия.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_Премия");
		ДвижениеПремия.ВКМ_Сотрудник = СтрокаСписка.ВКМ_Сотрудник;
		ДвижениеПремия.ВКМ_Результат = СтрокаСписка.ВКМ_СуммаПремии;

		ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.ПериодРегистрации = НачалоДня(Дата);
		ДвижениеНДФЛ.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ");
		ДвижениеНДФЛ.ВКМ_Сотрудник = СтрокаСписка.ВКМ_Сотрудник;
		ДвижениеНДФЛ.ВКМ_Результат = СтрокаСписка.ВКМ_СуммаПремии * СтавкаНДФЛ;

		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчеты.Период = НачалоДня(Дата);
		ДвижениеВзаиморасчеты.ВКМ_Сотрудник = СтрокаСписка.ВКМ_Сотрудник;
		ДвижениеВзаиморасчеты.ВКМ_Сумма = ДвижениеПремия.ВКМ_Результат - ДвижениеНДФЛ.ВКМ_Результат;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
